GarageClient/Web.config

<?xml version="1.0"?>
<configuration>
  <configSections>
    <sectionGroup name="applicationSettings" type="System.Configuration.ApplicationSettingsGroup, System, Version=2.0.0.0, Culture=neutral, PublicKeyToken=b77a5c561934e089">
      <section name="GarageClient.Properties.Settings" type="System.Configuration.ClientSettingsSection, System, Version=2.0.0.0, Culture=neutral, PublicKeyToken=b77a5c561934e089" requirePermission="false"/>
    </sectionGroup>
  </configSections>
  <appSettings>
    <add key="VerwijsIndexURL" value="https://verwijsindex.azurewebsites.net/Service/VerwijsIndexService.svc"/>
  </appSettings>
  <connectionStrings>
    <add name="Denion.WebService.Database.SqlServer" connectionString="Replace"/>
    <add name="GarageClient.Properties.Settings.SqlServer" connectionString="Replace"/>
  </connectionStrings>
  <!--
    For a description of web.config changes see http://go.microsoft.com/fwlink/?LinkId=235367.

    The following attributes can be set on the <httpRuntime> tag.
      <system.Web>
        <httpRuntime targetFramework="4.5" />
      </system.Web>
  -->
  <system.web>
    <!-- 
            Set compilation debug="true" to insert debugging 
            symbols into the compiled page. Because this 
            affects performance, set this value to true only 
            during development.
        -->
    <globalization requestEncoding="utf-8" responseEncoding="utf-8" culture="nl-NL" uiCulture="nl-NL"/>
    <compilation debug="true" targetFramework="4.8"/>
    <!--
            The <authentication> section enables configuration 
            of the security authentication mode used by 
            ASP.NET to identify an incoming user. 
        -->
    <authentication mode="Windows"/>
    <!--
            The <customErrors> section enables configuration 
            of what to do if/when an unhandled error occurs 
            during the execution of a request. Specifically, 
            it enables developers to configure html error pages 
            to be displayed in place of a error stack trace.

        <customErrors mode="RemoteOnly" defaultRedirect="GenericErrorPage.htm">
            <error statusCode="403" redirect="NoAccess.htm" />
            <error statusCode="404" redirect="FileNotFound.htm" />
        </customErrors>
        -->
    <webServices>
      <soapExtensionTypes>
        <remove type="WebServiceSoapExtension.SoapReverserExtension, WebServiceSoapExtension, Version=1.0.0.0, Culture=neutral, PublicKeyToken=7c5b1e940054b693"/>
      </soapExtensionTypes>
    </webServices>
    <pages controlRenderingCompatibilityVersion="3.5" clientIDMode="AutoID">
      <controls>
        <add tagPrefix="sbs" tagName="Menu" src="~/Controls/SiteMenu.ascx"/>
        <add tagPrefix="vwx" namespace="WebControls" assembly="WebControls, Version=1.0.0.0, Culture=neutral, PublicKeyToken=null"/>
      </controls>
    </pages>
  </system.web>
  <applicationSettings>
    <GarageClient.Properties.Settings>
      <setting name="PaymentStartTemplate" serializeAs="String">
        <value>&lt;s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing"&gt;
  &lt;s:Header&gt;
    &lt;a:Action s:mustUnderstand="1"&gt;https://verwijsindex.shpv.nl/service/VerwijsIndex/PaymentStart&lt;/a:Action&gt;
    &lt;a:MessageID&gt;urn:uuid:&lt;!--GUID--&gt;&lt;/a:MessageID&gt;
    &lt;a:ReplyTo&gt;
      &lt;a:Address&gt;http://www.w3.org/2005/08/addressing/anonymous&lt;/a:Address&gt;
    &lt;/a:ReplyTo&gt;
    &lt;a:To s:mustUnderstand="1"&gt;&lt;!--To--&gt;&lt;/a:To&gt;
  &lt;/s:Header&gt;
  &lt;s:Body&gt;
    &lt;PaymentStart xmlns="https://verwijsindex.shpv.nl/service/"&gt;
      &lt;PaymentStartRequest xmlns:b="https://verwijsindex.shpv.nl/messages/" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;
        &lt;b:AreaManagerId&gt;&lt;!--AreaManagerId--&gt;&lt;/b:AreaManagerId&gt;
        &lt;b:AreaId&gt;&lt;!--AreaId--&gt;&lt;/b:AreaId&gt;
        &lt;b:VehicleId&gt;&lt;!--VehicleId--&gt;&lt;/b:VehicleId&gt;
        &lt;b:CountryCode&gt;&lt;!--CountryCode--&gt;&lt;/b:CountryCode&gt;
        &lt;b:AccessId&gt;&lt;!--AccessId--&gt;&lt;/b:AccessId&gt;
        &lt;b:StartDateTime&gt;&lt;!--StartDateTime--&gt;&lt;/b:StartDateTime&gt;
        &lt;b:EndDateTime&gt;&lt;!--EndDateTime--&gt;&lt;/b:EndDateTime&gt;
        &lt;b:Amount&gt;&lt;!--Amount--&gt;&lt;/b:Amount&gt;
        &lt;b:VAT&gt;&lt;!--VAT--&gt;&lt;/b:VAT&gt;
        &lt;b:Token&gt;&lt;!--Token--&gt;&lt;/b:Token&gt;
      &lt;/PaymentStartRequest&gt;
    &lt;/PaymentStart&gt;
  &lt;/s:Body&gt;
&lt;/s:Envelope&gt;</value>
      </setting>
    </GarageClient.Properties.Settings>
  </applicationSettings>
</configuration>